# -*-coding:utf-8 -*-

'''
@File       : test.py
@Author     : HW Shen
@Date       : 2020/2/14
@Desc       :
'''

import re
from models.SIF_model import text2sentence

#
# s = '''　　跌幅方面，可燃冰概念领跌，恒泰艾普下跌8.90%，石化机械、潜能恒信跌逾6%。网络游戏板块深度回调，天沃科技下跌8.34%，天润数娱下跌6.49%。雄安概念重挫，中持股份、京汉股份等跌逾7%。粤港澳、上海国资板块同样跌幅靠前。
# ","{""type"":""市场"",""site"":""中证网"",""commentNum"":""0"",""joinNum"":""0"",""clickNum"":""0"",""shareNum"":""0"",""url"":""http://www.cs.com.cn/gppd/201706/t20170623_5338869.html"",""site_sign"":""Cs"",""label"":"""",""summary"":"""",""is_hot"":""0"",""imgUrls"":""""}","地产股拉升难阻市场颓势 三大指数早盘集体跳水","http://www.cs.com.cn/gppd/201706/t20170623_5338869.html"
# "89601","","solidot@","九成以上的源包用逐位对应的方式构建，未来版本的 Debian 还将提供验证包的工具和元数据；X 显示系统不再需要 root 权限运行；GnuPG 经典版本将被淘汰，引入的现代版本增加了椭圆曲线加密，改进默认设置，模块化架构，改进智能卡支持；改进 UEFI 支持等。
# 软件方面的变化包括：Apache 2.4.25、Chromium 59.0.3071.8、Firefox 45.9、GIMP 2.8.18、更新版的 GNOME 3.22、GnuPG 2.1、LibreOffice 5.2、Linux 4.9、MariaDB 10.1、PHP 7.0....更详细清单见发布公告。
# ","{""type"":""软件"",""site"":""cnbeta"",""commentNum"":""12"",""joinNum"":""5844"",""clickNum"":""5813"",""shareNum"":""0"",""url"":""http://www.cnbeta.com/articles/soft/623605.htm"",""site_sign"":""cnbeta"",""label"":"""",""summary"":""Debian 发行版宣布正式释出代号为 Stretch 的 Debian 9，该版本将提供五年的支持。Stretch 将专门献给于 2015 年 12 月 28 日去世的项目创始人 Ian Murdock。Stretch 的主要变化包括：默认 MySQL 变种改为 MariaDB；Firefox 和 Thunderbird 替代去品牌名的版本 Iceweasel 和 Icedove；"",""is_hot"":""2"",""imgUrls"":""http://static.cnbetacdn.com/thumb/mini/article/2017/0618/ce18b298f9bbde6.jpg""}","Debian 9 Stretch 发布","http://www.cnbeta.com/articles/soft/623605.htm"
# "89600","","新华网","国歌法草案首次提请最高立法机关审议
# 点击图片进入下一页
# 新闻：十二届全国人大常委会第二十八次会议22日首次开始审议国歌法草案。草案对应当奏唱国歌的场合，国歌标准曲谱的审定、发布和使用，奏唱礼仪规范以及不得奏唱、播放国歌的场合等做出规范。草案规定，在公共场合，恶意修改国歌歌词或者故意以歪曲、贬损方式奏唱国歌，损害国歌庄严形象的，由公安机关处以十五日以下拘留。（新闻来源：新华社）
# 点评：国歌代表了一个国家的气质，也是一个国家的象征。为国歌立法，不仅有助于推动实现国旗、国徽、国歌等国家象征标志物立法的完整统一，而且有助于纠正现实中存在的种种不规范国歌使用状况，有力捍卫国歌应有的严肃性和神圣性。
# 刘洪滨代言假药月销售额近百万元
# 点击图片进入下一页
# 新闻：近日，一位名叫刘洪滨（“滨”有时写作“斌”）的“老专家”被发现多次在各大电视台的“健康医药”节目中，参与推广的药品、功效也是五花八门。有时是苗医传人，有时是蒙医传人，偶尔还会客串一下北大专家和医院退休的老院长……由于刘洪滨出现在电视画面中的身份完全不同，也被网友戏称为“虚假医药广告表演艺术家”。（新闻来源：北京青年报）
# ","{""type"":""观点滚动"",""site"":""参考消息"",""commentNum"":""0"",""joinNum"":""0"",""clickNum"":""0"",""shareNum"":""0"",""url"":""http://column.cankaoxiaoxi.com/plgd/2017/0623/2143254.shtml"",""site_sign"":""Cankaoxiaoxi"",""label"":"""",""summary"":"""",""is_hot"":""0"",""imgUrls"":""[http://upload.cankaoxiaoxi.com/temp/2017/0623/1498202937977.jpg, http://upload.cankaoxiaoxi.com/temp/2017/0623/1498202937304.jpg]""}","[及时点]我们不需要“百变老太太”","http://column.cankaoxiaoxi.com/plgd/2017/0623/2143254.shtml"
# "89599","张怡","中国证券报?中证网","　　中证网讯 （本报记者 张怡）今日，三板做市指数继续低开下行，盘中最低触及1057.91点，刷新本轮调整新低，中午收盘时下跌0.18%收于1057.97点，成交额为9293万元，环比小幅放量。
# 　　成交方面，今日新三板中共有10只新三板个股的成交额超过千万元，其中，百姓网的成交额最高，达到1.65亿元；京源环保和华腾教育的成交额也均超过2000万元。
# 　　涨跌幅方面，滴滴集运的涨幅最高，半日上涨400%，收于5元；此外，共有包括朗源科技、白水农夫、万杰智能等9只个股的涨幅达到100%；相对而言，共有包括百乐米业、中源股份、一森园林等在内的8只个股跌幅均为50%。
# ","{""type"":""市场"",""site"":""中证网"",""commentNum"":""0"",""joinNum"":""0"",""clickNum"":""0"",""shareNum"":""0"",""url"":""http://www.cs.com.cn/gppd/201706/t20170623_5338894.html"",""site_sign"":""Cs"",""label"":"""",""summary"":"""",""is_hot"":""0"",""imgUrls"":""""}","新三板午评：三板做市指数刷新阶段低点","http://www.cs.com.cn/gppd/201706/t20170623_5338894.html"
# "89598","周佳 整理","中国证券报?中证网","　　提示声明：
# 　　本文涉及的行业及个股分析来源于券商研究报告，仅为分析人士对该行业及个股的个人观点，不代表中证网观点，不作为投资者买卖股票的依据，股市有风险，投资须谨慎。
# 　　1、汽车及零部件行业2017年中期策略：分化凸显领军自主 电动智能贯穿汽车变革？？？?
# 　　报告摘要:'''


# str = re.sub('[a-zA-Z0-9!；：（）"#$%&\'()*+,-./:;<=>?@，。★▌▲●、…【】《》？“”‘’！[\\]^_`{|}~\s]+', "", s)
# print(str)
# # 去除不可见字符
# res = re.sub('[\001\002\003\004\005\006\007\x08\x09\x0a\x0b\x0c\x0d\x0e\x0f\x10\x11\x12\x13\x14\x15\x16\x17\x18\x19\x1a]+', '', str)
# print(res)

# # 去除停止词
# with open("data/stopwords.txt", encoding="utf-8-sig") as f:
#     stopwords = [line.strip() for line in f.readlines()]
#
# print(stopwords[:10])


text = "“新闻：十二届全国人大常委会第二十八次会议22日首次开始审议国歌法草案。草案对应当奏唱国歌的场合，" \
       "国歌标准曲谱的审定、发布和使用，奏唱礼仪规范以及不得奏唱、播放国歌的场合等做出规范。草案规定，在公共场合，" \
       "恶意修改国歌歌词或者故意以歪曲、贬损方式奏唱国歌，损害国歌庄严形象的，由公安机关处以十五日以下拘留。”" \
       "（新闻来源：新华社）点评：国歌代表了一个国家的气质，也是一个国家的象征。为国歌立法，不仅有助于推动实现国旗、" \
       "国徽、国歌等国家象征标志物立法的完整统一，而且有助于纠正现实中存在的种种不规范国歌使用状况，" \
       "有力捍卫国歌应有的严肃性和神圣性。刘洪滨代言假药月销售额近百万元"


result = text2sentence(text)

print(result)